ninety_nine_cats/app/controllers/cats_controller.rb

    def create
        @cat = Cat.new(cat_params)

        if @cat.save
---
INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def update
        @cat = Cat.find_by(id: params[:id])

        if @cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "description" = ?, "updated_at" = ? WHERE "cats"."id" = ?  [["description", "Pretty wild kitty"], ["updated_at", "2019-04-02 23:47:00.055664"], ["id", 1]]